In [1]:
import pandas as pd
from io import StringIO

# Corrected JSON data
Data = '''{
    "Employee Name": ["James"],
    "Email": ["james@gmail.com"],
    "Job Profile": [{"Title1": "Team Lead", "Title2": "Sr. Developer"}]
}'''

# Load JSON data into DataFrame
df = pd.read_json(StringIO(Data))
df.head()

,Employee Name,Email,Job Profile
0,James,james@gmail.com,"{'Title1': 'Team Lead', 'Title2': 'Sr. Develop..."

In [2]:
df.to_json()

'{"Employee Name":{"0":"James"},"Email":{"0":"james@gmail.com"},"Job Profile":{"0":{"Title1":"Team Lead","Title2":"Sr. Developer"}}}'

In [3]:
df.to_json(orient="records")

'[{"Employee Name":"James","Email":"james@gmail.com","Job Profile":{"Title1":"Team Lead","Title2":"Sr. Developer"}}]'

In [4]:
df.to_json(orient="index")

'{"0":{"Employee Name":"James","Email":"james@gmail.com","Job Profile":{"Title1":"Team Lead","Title2":"Sr. Developer"}}}'

In [5]:
df.to_json(orient="values")

'[["James","james@gmail.com",{"Title1":"Team Lead","Title2":"Sr. Developer"}]]'

In [6]:
df = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data', header=None)
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
1,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
2,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
3,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480
4,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735

In [7]:
df.to_csv('wine.csv')

In [8]:
%pip install html5lib
%pip install lxml
%pip install BeautifulSoup4

Requirement already satisfied: html5lib in c:\users\tarak\downloads\krish naik\ml bootcamp\venv\lib\site-packages (1.1)Note: you may need to restart the kernel to use updated packages.

Requirement already satisfied: six>=1.9 in c:\users\tarak\downloads\krish naik\ml bootcamp\venv\lib\site-packages (from html5lib) (1.16.0)
Requirement already satisfied: webencodings in c:\users\tarak\downloads\krish naik\ml bootcamp\venv\lib\site-packages (from html5lib) (0.5.1)
Requirement already satisfied: lxml in c:\users\tarak\downloads\krish naik\ml bootcamp\venv\lib\site-packages (5.3.0)
Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: BeautifulSoup4 in c:\users\tarak\downloads\krish naik\ml bootcamp\venv\lib\site-packages (4.12.3)
Requirement already satisfied: soupsieve>1.2 in c:\users\tarak\downloads\krish naik\ml bootcamp\venv\lib\site-packages (from BeautifulSoup4) (2.6)
Note: you may need to restart the kernel to use updated packages.

In [9]:
url = 'https://www.fdic.gov/bank/individual/failed/banklist.html'
dfs = pd.read_html(url)
dfs[0].head()

,Bank Name,City,State,Cert,Aquiring Institution,Closing Date,Fund
0,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
1,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
2,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544
3,First Republic Bank,San Francisco,California,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
4,Signature Bank,New York,New York,57053,"Flagstar Bank, N.A.","March 12, 2023",10540

In [10]:
url = "https://en.wikipedia.org/wiki/Mobile_country_code"
dfs = pd.read_html(url, match="Country", header=0)
dfs[0].head()

,Mobile country code,Country,ISO 3166,Mobile network codes,National MNC authority,Remarks
0,289,A Abkhazia,GE-AB,List of mobile network codes in Abkhazia,NaN,MCC is not listed by ITU
1,412,Afghanistan,AF,List of mobile network codes in Afghanistan,NaN,NaN
2,276,Albania,AL,List of mobile network codes in Albania,NaN,NaN
3,603,Algeria,DZ,List of mobile network codes in Algeria,NaN,NaN
4,544,American Samoa (United States of America),AS,List of mobile network codes in American Samoa,NaN,NaN